[
  {
    "id": "1",
    "company": "Hyp3r",
    "companyUrl": "https://hyp3r.com",
    "contractorCompany": "",
    "country": "USA",
    "role": "Tech Lead",
    "fromMonth": "NOV",
    "toMonth": "AUG",
    "fromYear": "2015",
    "toYear": "2019",
    "time": "3Y+9m",
    "timeDescription": "3 years 9 months",
    "descriptionShort": [
      "Technical leader and senior javascript developer in a five members team for 'Engage'",
      "the Hyp3r enterprise web app."
    ],
    "description": [
      "As the web technical lead for the 'Engage' web app I was in charge of a five members team that built and maintained the enterprise SPA web/mobile app. 'Engage' allowed enterprise customers like Marriott or Norwegian Cruise Line to engage with their customers on close to real time using Instagram, Twitter or Weibo (for the chinese market).",
      "The team worked remotely for years across multiple timezones, with main headquarters in San Francisco and developers in Costa Rica, USA, Puerto Rico, Argentina and Colombia.",
      "As a senior frontend developer I created code from the Proof of Concept phase until it reached enterprise audience. The web app was developed using a mix of AngularJs, React and pure JS, and was built using gulp + browserify. I also developed a private web browser extension available for customers that ran on the last versions of Chrome, Firefox and MS Edge."
    ],
    "tech_dev": "HTML5, CSS3, less, AngularJS, React, Redux, styled-components, masonry, bootstrap, axios, google maps, mapbox.",
    "tech_build": "gulp, browserify, babel, circleCI, storybook.",
    "tech_test": "jest, enzyme."
  },
  {
    "id": "2",
    "company": "GForge",
    "companyUrl": "https://gforge.com",
    "contractorCompany": "",
    "country": "USA",
    "role": "Senior developer",
    "fromMonth": "NOV",
    "toMonth": "NOV",
    "fromYear": "2013",
    "toYear": "2015",
    "time": "2Y",
    "timeDescription": "2 years",
    "descriptionShort": [
      "Senior PHP/JavaScript developer for the Gforge Advanced Server SaaS web app team."
    ],
    "description": [
      "Senior PHP developer in a five members team build new features and providing maintenance for the company enterprise web app.",
      "GForge AS is a SaaS application that provides project management, team chat, continuous integration, git code reviews, git pull requests, etc. I developed PHP code and built functionality on Angular JS for chat."
    ],
    "tech_dev": "HTML5, CSS3, PHP, AngularJS, vanilla JavaScript.",
    "tech_build": "Jenkins.",
    "tech_test": "PHPUnit, jazmine."
  },
  {
    "id": "3",
    "company": "Playdom - Disney",
    "companyUrl": "https://en.wikipedia.org/wiki/Playdom",
    "contractorCompany": "",
    "isInsite": true,
    "country": "Argentina",
    "role": "Tech Lead",
    "fromMonth": "DEC",
    "toMonth": "SET",
    "fromYear": "2012",
    "toYear": "2013",
    "time": "9m",
    "timeDescription": "9 months",
    "descriptionShort": [
      "Technical leader and senior PHP developer in a three members team for 'Criminal Empire' Facebook game."
    ],
    "description": [
      "Lead team developing and maintaining the 'Criminal Empire' Facebook game. Game customers required high availability, the aa had web and mobile heavy traffic. Senior developer on confidential mobile projects.",
      "Playdom Argentina offices closed in September 2013, and the whole company closed on 2014."
    ],
    "tech_dev": "OO PHP, MongoDB, Backbone, Google Apps Scripts, Jenkins, Jira, github, git, Maven, Spring.",
    "tech_build": "",
    "tech_test": "PHPUnit."
  },
  {
    "id": "4",
    "company": "LiveOps",
    "companyUrl": "http://liveops.com",
    "contractorCompany": "GlobalLogic",
    "country": "USA",
    "role": "Tech Lead",
    "fromMonth": "JUL",
    "toMonth": "DEC",
    "fromYear": "2011",
    "toYear": "2012",
    "time": "1Y+5m",
    "timeDescription": "1 year 3 months",
    "descriptionShort": [
      "Lead the dev team in charge of LiveOps customer online service. Backend Perl module development, UI development with HTML/CSS/Javascript."
    ],
    "description": [
      "Hired by GlobalLogic Argentina as Tech lead for a 10 member team in La Plata and Buenos Aires, working for Silicon Valley SaaS company LiveOps.",
      "Received a 6 weeks training course in San Jose, California. In charge of development and maintenance of the web module, RTM (Real Time Monitoring) area and security for the LiveOps SaaS callcenter application.",
      "Development of Perl web modules, JavaScript integration with SalesForce service, Linux maintenance, QA scripting automation."
    ],
    "tech_dev": "Perl (mod_perl, Mason perl framework, scripts), MySQL, Rally, CVS, SVN, git, JavaScript, JQuery, Coffeescript, Backbone JS, Rally, Bugzilla, Linux, Ruby, HTML, CSS, Redis.",
    "tech_build": "",
    "tech_test": "Custom Perl unit test modules."
  },
  {
    "id": "5",
    "company": "Electronics Arts",
    "companyUrl": "https://www.ea.com",
    "contractorCompany": "Globant",
    "country": "USA",
    "role": "Tech Lead",
    "fromMonth": "DIC",
    "toMonth": "JUN",
    "fromYear": "2010",
    "toYear": "2011",
    "time": "7m",
    "timeDescription": "7 months",
    "descriptionShort": [
      "Tech Lead on traffic report intranet portal for EA online games. Lead a remote team in India."
    ],
    "description": [
      "Developed of a real time web report system using LAMP.",
      "The system provided statistics for all the EA online games on all of their platforms (PS2, PS3, XBOX 360, Wii, etc.). "
    ],
    "tech_dev": "PHP Symfony, MySQL, Linux, JavaScript, JQuery.",
    "tech_build": "",
    "tech_test": ""
  },
  {
    "id": "6",
    "company": "Playdom",
    "companyUrl": "https://en.wikipedia.org/wiki/Playdom",
    "contractorCompany": "Globant",
    "country": "USA",
    "role": "Tech Lead",
    "fromMonth": "DIC",
    "toMonth": "SET",
    "fromYear": "2009",
    "toYear": "2010",
    "time": "9m",
    "timeDescription": "9 months",
    "descriptionShort": [
      "Tech Lead for the WSOP game on Facebook, Hi5, MySpace."
    ],
    "description": [
      "Tech lead for the Playdom - Poker Palace / WSOP poker game provided on Facebook, Hi5 and MySpace."
    ],
    "tech_dev": "ActionScript, Java, PHP, JavaScript.",
    "tech_build": "",
    "tech_test": ""
  },
  {
    "id": "7",
    "company": "Globant",
    "companyUrl": "https://www.globant.com",
    "contractorCompany": "",
    "isInsite": true,
    "country": "Argentina",
    "role": "PHP Sr. Dev / Tech Lead",
    "fromMonth": "AUG",
    "toMonth": "JUN",
    "fromYear": "2009",
    "toYear": "2011",
    "time": "1Y+10m",
    "timeDescription": "1 year 2 months",
    "descriptionShort": [
      "Lead teams oriented to develop Social applications and web projects. Interview PHP dev candidates for the company."
    ],
    "description": [
      "Lead multiple teams for diverse projects, from FaceBook applications to online games. Team members had different seniority levels and were proficient on multiple technologies such as Java devs, ActionScript devs, QA engineers, PHP developers, etc.",
      "Support to sales area creating tech documentation for Globant customer proposals."
    ],
    "tech_dev": "Facebook API, REST APIs, jQuery, CakePHP, Doctrine ORM, ActionScript 3, java, Zend framework, CSS, javascript, MySQL, Code Igniter, PHP Symfony, Open Social, Jira, Confluence, Perforce.",
    "tech_build": "Ant, Hudson.",
    "tech_test": ""
  },
  {
    "id": "8",
    "company": "Amauta Technologies",
    "companyUrl": "https://vimeo.com/amautalab",
    "contractorCompany": "",
    "isInsite": true,
    "country": "Peru",
    "role": "Senior Developer",
    "fromMonth": "JAN",
    "toMonth": "JUL",
    "fromYear": "2002",
    "toYear": "2009",
    "time": "7Y+6m",
    "timeDescription": "7 years 6 months",
    "descriptionShort": [
      "Lead the dev team building static and dynamic web sites. All developers worked remotely from Peru, Argentina and Los Angeles."
    ],
    "description": [
      "Lead a team of developers to build and maintain websites, frontend and backend modules for amautalab customers on Los Angeles and New York.",
      "In 2002 developed panaka, an online web drive service using mod_perl installed on customer dedicated servers.",
      "Projects:Toyota Scion site, Toyota Mundo Yaris site, isuma.tv canadian portal, Sanrio online licensing approval system, La Agencia de Orci site, Casanova Pendrill site, AIM V site, aiwaworld.com dynamic content, Art Center College of Design site facelift, panaka.com Perl backend engine."
    ],
    "tech_dev": "Perl scripting, mod_perl, OO PHP, Zend framework, Ajax, Prototype, jQuery, Dojo, Scriptaculous, LAMP, Cocoa, ActionScript 3, HTML, CSS, Javascript, SVN, Regular Expressions, Pluck API.",
    "tech_build": "",
    "tech_test": ""
  },
  {
    "id": "9",
    "company": "Phantasia",
    "companyUrl": "http://www.wundermanthompson.pe/",
    "contractorCompany": "",
    "isInsite": true,
    "country": "Peru",
    "role": "Web Developer",
    "fromMonth": "JUL",
    "toMonth": "JAN",
    "fromYear": "1997",
    "toYear": "2002",
    "time": "4Y+6m",
    "timeDescription": "4 years 6 months",
    "descriptionShort": [
      "Learn open source web technologies, focused on LAMP. Build the web team."
    ],
    "description": [
      "First IT employee on the company. Lead the dev team in charge of creating and maintaining web sites for the company customers like Telefonica Peru projects, BellSouth Peru projects, Presidential elections 2001, etc."
    ],
    "tech_dev": "LAMP, java, HTML, CSS, Javascript, Linux servers administrator, Macromedia Dreamweaver, Macromedia Fireworks.",
    "tech_build": "",
    "tech_test": ""
  },
  {
    "id": "10",
    "company": "INDECOPI",
    "companyUrl": "https://www.indecopi.gob.pe",
    "contractorCompany": "",
    "isInsite": true,
    "country": "Peru",
    "role": "Intern",
    "fromMonth": "JUL",
    "toMonth": "JUL",
    "fromYear": "1996",
    "toYear": "1997",
    "time": "1Y",
    "timeDescription": "1 year",
    "descriptionShort": [
      "Tech support, website reengineering and development."
    ],
    "description": [
      "Define career path learning different IT tasks, such as tech support, development, networking, etc."
    ],
    "tech_dev": "Novel Netware, HTML, Javascript, CSS, C language CGIs.",
    "tech_build": "",
    "tech_test": ""
  }
]