[
  {
    "id": "1",
    "company": "Atomic Reach",
    "companyUrl": "https://www.atomicreach.com/",
    "contractorCompany": "Band of Coders",
    "country": "Canada",
    "role": "Frontend Developer",
    "fromMonth": "DEC",
    "toMonth": "FEB",
    "fromYear": "2019",
    "toYear": "2020",
    "time": "3m",
    "timeDescription": "3 months",
    "descriptionShort": [
      "Frontend developer providing maintenance to the React app and WordPress plugin."
    ],
    "description": [
      "In the frontend developer role I provided bug fixes and code reviews to the React SPA web app and the WordPress plugin. The plugin had two versions, a vanilla JS codebase for the WordPress Classic editor and a React app for the Gutenberg editor.",
      "I was in charge of frontend duties but had to test the whole flow managing my own linux instance containing the Zend framework PHP API in order to detect bugs."
    ],
    "tech_dev": "React, Redux, HTML, vanilla JavaScript, tinyMCE, jQuery.",
    "tech_build": "WordPress, Linux VM with PHP Zend framework + MySQL.",
    "tech_test": "Jest."
  },
  {
    "id": "2",
    "company": "Hyp3r",
    "companyUrl": "https://hyp3r.com",
    "contractorCompany": "",
    "country": "USA",
    "role": "Tech Lead",
    "fromMonth": "NOV",
    "toMonth": "AUG",
    "fromYear": "2015",
    "toYear": "2019",
    "time": "3Y+9m",
    "timeDescription": "3 years 9 months",
    "descriptionShort": [
      "Technical leader and senior javascript developer in a five members team for 'Engage', the Hyp3r enterprise web app."
    ],
    "description": [
      "As the web technical lead for the 'Engage' web app I was in charge of a five members team that built and maintained the enterprise SPA web/mobile app. 'Engage' allowed enterprise customers like Marriott or Norwegian Cruise Line to engage with their customers on near real time using Instagram, Twitter or Weibo (in the chinese market).",
      "The team worked remotely across multiple timezones, with main headquarters in San Francisco and developers from Costa Rica, USA, Puerto Rico, Argentina and Colombia.",
      "As a senior frontend developer I created code from the Proof of Concept phase until it reached enterprise audiences. The web app was developed using a mix of AngularJs, React and pure JS, and was built using Gulp + browserify. We developed a private web browser extension available for customers that ran on Chrome, Firefox and MS Edge."
    ],
    "tech_dev": "HTML5, CSS3, Less, AngularJS, React, Redux, Styled-Components, Masonry, Bootstrap, Axios, Google maps, Mapbox.",
    "tech_build": "Gulp, Browserify, Babel, CircleCI, Storybook.",
    "tech_test": "Jest, Enzyme."
  },
  {
    "id": "3",
    "company": "GForge",
    "companyUrl": "https://gforge.com",
    "contractorCompany": "",
    "country": "USA",
    "role": "Senior developer",
    "fromMonth": "NOV",
    "toMonth": "NOV",
    "fromYear": "2013",
    "toYear": "2015",
    "time": "2Y",
    "timeDescription": "2 years",
    "descriptionShort": [
      "Senior PHP/JavaScript developer in the Gforge Advanced Server SaaS web app team."
    ],
    "description": [
      "Senior PHP developer in a five members team, building new features and providing maintenance for the company enterprise web app.",
      "GForge AS is a SaaS application that provides project management, team chat, continuous integration, git code reviews, git pull requests, etc. I developed PHP code and built functionality on Angular JS for the chat module."
    ],
    "tech_dev": "HTML5, CSS3, PHP, AngularJS, pure JavaScript.",
    "tech_build": "Jenkins.",
    "tech_test": "PHPUnit, Jazmine."
  },
  {
    "id": "4",
    "company": "Playdom - Disney",
    "companyUrl": "https://en.wikipedia.org/wiki/Playdom",
    "contractorCompany": "",
    "isInsite": true,
    "country": "Argentina",
    "role": "Tech Lead",
    "fromMonth": "DEC",
    "toMonth": "SET",
    "fromYear": "2012",
    "toYear": "2013",
    "time": "9m",
    "timeDescription": "9 months",
    "descriptionShort": [
      "Technical leader, Sr. PHP developer in a three members team for the 'Criminal Empire' Facebook game."
    ],
    "description": [
      "Lead a team developing and maintaining the 'Criminal Empire' Facebook game. Game customers required high availability on heavy traffic for the web and mobile apps. Senior developer on confidential mobile projects.",
      "Playdom Argentina offices closed in September 2013, and the whole company closed on 2014."
    ],
    "tech_dev": "OOP PHP, MongoDB, Backbone, Google Apps Scripts, Jenkins, Jira, Github, Git, Maven, Spring.",
    "tech_build": "",
    "tech_test": "PHPUnit."
  },
  {
    "id": "5",
    "company": "LiveOps",
    "companyUrl": "http://liveops.com",
    "contractorCompany": "GlobalLogic",
    "country": "USA",
    "role": "Tech Lead",
    "fromMonth": "JUL",
    "toMonth": "DEC",
    "fromYear": "2011",
    "toYear": "2012",
    "time": "1Y+5m",
    "timeDescription": "1 year 3 months",
    "descriptionShort": [
      "Lead the dev team in charge of LiveOps customer online service. Backend Perl module development, UI development with HTML/CSS/Javascript."
    ],
    "description": [
      "Hired by GlobalLogic Argentina as Tech lead for a 10 member team in La Plata city and Buenos Aires, our team was assigned full time to the Silicon Valley SaaS company LiveOps.",
      "Received a 6 weeks training course in San Jose, California. In charge of development and maintenance of the web module, RTM (Real Time Monitoring) area and security for the LiveOps SaaS callcenter application.",
      "Developed Perl web modules, JavaScript integration with SalesForce service, Linux maintenance, QA scripting automation."
    ],
    "tech_dev": "Perl (mod_perl, Mason perl framework, scripts), MySQL, Rally, CVS, SVN, Git, JavaScript, JQuery, Coffeescript, Backbone JS, Rally, Bugzilla, Linux, Ruby, HTML, CSS, Redis.",
    "tech_build": "",
    "tech_test": "Custom Perl unit test modules."
  },
  {
    "id": "6",
    "company": "Electronics Arts",
    "companyUrl": "https://www.ea.com",
    "contractorCompany": "Globant",
    "country": "USA",
    "role": "Tech Lead",
    "fromMonth": "DIC",
    "toMonth": "JUN",
    "fromYear": "2010",
    "toYear": "2011",
    "time": "7m",
    "timeDescription": "7 months",
    "descriptionShort": [
      "Tech Lead on traffic report intranet portal for EA online games. Lead a remote team in India."
    ],
    "description": [
      "Hired by Globant to develop of a real time web report system using LAMP for their customer Electonic Arts (EA).",
      "The system provided statistics for EA online games on all their platforms (PS2, PS3, XBOX 360, Wii, etc.). "
    ],
    "tech_dev": "PHP Symfony, MySQL, Linux, JavaScript, JQuery.",
    "tech_build": "",
    "tech_test": "PHPUnit."
  },
  {
    "id": "7",
    "company": "Playdom",
    "companyUrl": "https://en.wikipedia.org/wiki/Playdom",
    "contractorCompany": "Globant",
    "country": "USA",
    "role": "Tech Lead",
    "fromMonth": "DIC",
    "toMonth": "SET",
    "fromYear": "2009",
    "toYear": "2010",
    "time": "9m",
    "timeDescription": "9 months",
    "descriptionShort": [
      "Tech Lead for the WSOP game on Facebook, Hi5, MySpace."
    ],
    "description": [
      "Hired by Globant to lead the team in charge of the Poker Palace / WSOP poker game for the US Playdom company. The web app ran on Facebook, Hi5 and MySpace."
    ],
    "tech_dev": "ActionScript, Java, PHP, JavaScript.",
    "tech_build": "",
    "tech_test": ""
  },
  {
    "id": "8",
    "company": "Globant",
    "companyUrl": "https://www.globant.com",
    "contractorCompany": "",
    "isInsite": true,
    "country": "Argentina",
    "role": "PHP Sr. Dev / Tech Lead",
    "fromMonth": "AUG",
    "toMonth": "JUN",
    "fromYear": "2009",
    "toYear": "2011",
    "time": "1Y+10m",
    "timeDescription": "1 year 2 months",
    "descriptionShort": [
      "Lead teams oriented to develop Social applications and web projects. Interview PHP dev candidates for the company."
    ],
    "description": [
      "Lead multiple teams for diverse projects, from FaceBook applications to online games. Team members had different seniority levels and were proficient on multiple technologies such as Java devs, ActionScript devs, QA engineers, PHP developers, etc.",
      "Support to sales area creating tech documentation for Globant customer proposals."
    ],
    "tech_dev": "Facebook API, REST APIs, JQuery, CakePHP, PHP Doctrine ORM, ActionScript 3, Java, PHP Zend framework, CSS, Javascript, MySQL, PHP Code Igniter, PHP Symfony, Open Social, Jira, Confluence, Perforce.",
    "tech_build": "Ant, Hudson.",
    "tech_test": ""
  },
  {
    "id": "9",
    "company": "Amauta Technologies",
    "companyUrl": "https://vimeo.com/amautalab",
    "contractorCompany": "",
    "isInsite": true,
    "country": "Peru",
    "role": "Senior Developer",
    "fromMonth": "JAN",
    "toMonth": "JUL",
    "fromYear": "2002",
    "toYear": "2009",
    "time": "7Y+6m",
    "timeDescription": "7 years 6 months",
    "descriptionShort": [
      "Lead the dev team building customers web sites. All developers worked remotely from Peru, Argentina and USA."
    ],
    "description": [
      "Lead a developers team building and providing support for websites, frontend and backend modules for Amautalab customers on Los Angeles and New York.",
      "In 2002 developed Panaka, an online web drive service using mod_perl installed on customer dedicated servers.",
      "Projects: Toyota Scion site, Toyota Mundo Yaris site, isuma.tv (canadian portal), Sanrio online licensing approval system, La Agencia de Orci site, Casanova Pendrill site, AIM V site, aiwaworld.com dynamic content, Art Center College of Design site facelift, panaka.com Perl backend engine, etc."
    ],
    "tech_dev": "Perl scripting, mod_perl, OOP PHP, PHP Zend Framework, Ajax, Prototype, JQuery, Dojo, Scriptaculous, LAMP, Cocoa, ActionScript 3, HTML, CSS, Javascript, SVN, Regular Expressions, Pluck API.",
    "tech_build": "",
    "tech_test": ""
  },
  {
    "id": "10",
    "company": "Phantasia",
    "companyUrl": "http://www.wundermanthompson.pe/",
    "contractorCompany": "",
    "isInsite": true,
    "country": "Peru",
    "role": "Web Developer",
    "fromMonth": "JUL",
    "toMonth": "JAN",
    "fromYear": "1997",
    "toYear": "2002",
    "time": "4Y+6m",
    "timeDescription": "4 years 6 months",
    "descriptionShort": [
      "Learn open source web technologies, focused on LAMP. Build the web team."
    ],
    "description": [
      "First IT employee on the company. Lead the development team in charge of creating and maintaining web sites for the company customers like Telefonica Peru, BellSouth Peru, the Presidential elections in 2001, etc."
    ],
    "tech_dev": "LAMP, Java, HTML, CSS, Javascript, Linux servers administrator, Macromedia Dreamweaver, Macromedia Fireworks, MS Frontpage.",
    "tech_build": "",
    "tech_test": ""
  },
  {
    "id": "11",
    "company": "INDECOPI",
    "companyUrl": "https://www.indecopi.gob.pe",
    "contractorCompany": "",
    "isInsite": true,
    "country": "Peru",
    "role": "Intern",
    "fromMonth": "JUL",
    "toMonth": "JUL",
    "fromYear": "1996",
    "toYear": "1997",
    "time": "1Y",
    "timeDescription": "1 year",
    "descriptionShort": [
      "Tech support, website reengineering and development."
    ],
    "description": [
      "Define career path learning different IT tasks, such as tech support, development, networking, etc."
    ],
    "tech_dev": "Novel Netware, HTML, Javascript, CSS, C language CGIs.",
    "tech_build": "",
    "tech_test": ""
  }
]